function showtext(){
    console.log("mushaobs");

    let xili = [
         "🌐 ყოველი ახალი ვებგვერდი, რომელსაც შექმნი, შენი იდეების ციფრულ რეალობად ქცევის კიდევ ერთი ნაბიჯია.",
  "💻 Frontend დეველოპმენტი გაძლევს შესაძლებლობას შექმნა ისეთი ვებსაიტები, რომლებსაც ყოველდღიურად ათასობით ადამიანი გამოიყენებს.",
  "🚀 HTML, CSS და JavaScript-ის ცოდნა კარიერის უამრავ შესაძლებლობას გიხსნის მთელ მსოფლიოში.",
  "🎨 Frontend დეველოპერი ერთდროულად არის როგორც პროგრამისტი, ისე დიზაინერი, რომელიც ტექნოლოგიასა და კრეატიულობას აერთიანებს.",
  "📈 ყოველი დაწერილი კოდი შენს უნარებს აძლიერებს და პროფესიონალ დეველოპერობას უფრო გაუახლოვებს.",
  "🔥 წარმატებული ვებდეველოპერები ოდესღაც დამწყებები იყვნენ — განსხვავება მხოლოდ იმაშია, რომ მათ სწავლა არ შეუწყვეტიათ.",
  "🌟 შენ მიერ შექმნილი პირველი ვებსაიტი შეიძლება გახდეს დიდი პროექტების და წარმატებული კარიერის დასაწყისი.",
  "🧩 პროგრამირება პრობლემების გადაჭრის ხელოვნებაა, ხოლო Frontend დეველოპმენტი ამ ხელოვნების ყველაზე თვალსაჩინო ფორმაა.",
  "🌍 ვებტექნოლოგიების ცოდნა საშუალებას გაძლევს იმუშაო ნებისმიერი ადგილიდან და ითანამშრომლო მსოფლიოს სხვადასხვა კომპანიასთან.",
  "💡 დღეს ნასწავლი ერთი ახალი ტექნოლოგია ხვალ შეიძლება შენი ყველაზე ძლიერი პროფესიული უპირატესობა გახდეს."
    ]

    let ragacricxvi = Math.floor(Math.random()*xili.length)  ;
    console.log(ragacricxvi);
    
    
    


    document.getElementById("text").innerHTML = xili[ragacricxvi];

}

const logo = document.getElementById("logo");

logo.addEventListener("click", showtext);